This is a generated file for the l3build validation system.
Don't change this file in any respect.
============================================================
TEST 1: label command with default config
============================================================
\label {my:test0}
============================================================
============================================================
TEST 2: default reference command with default config
============================================================
\ref {my:test0}, \ref {my:test1}, \ref {my:test2}
============================================================
============================================================
TEST 3: option should be ignored without scope feature
============================================================
\ref {my:x:test0}, \ref {my:x:test1}, \ref {my:x:test2}
============================================================
============================================================
TEST 4: ref-like command with and without style
============================================================
Section \relax {sec:test0}, \relax {sec:test1}, and \relax {sec:test2}
\ref {sec:test0}, \ref {sec:test1}, \ref {sec:test2}
============================================================
============================================================
TEST 5: label command without namespace
============================================================
\label {test0}
============================================================
============================================================
TEST 6: reference command without namespace
============================================================
\ref {test0}, \ref {test1}, \ref {test2}
============================================================
============================================================
TEST 7: label commands with the scope feature
============================================================
\label {figtab:\the0 :test0}
\label {figtab:\the0 :test1}
============================================================
============================================================
TEST 8: ref commands with the scope feature
============================================================
\ref {figtab:\the0 :test0}, \ref {figtab:\the0 :test1}
\ref {figtab:x:test0}, \ref {figtab:x:test1}
============================================================
